// Задача 26: Напишите программу, которая принимает на вход число и выдаёт количество цифр в числе.
// 456 -> 3
// 78 -> 2
// 89126 -> 5

Console.Clear();

Console.WriteLine("Введите число...");

int numb = int.Parse(Console.ReadLine()!);

int Numbers(int number)
{
    
}
